In [2]:
#five function in pandas
#1.read_csv()
#2.info()
#3.groupby()
#4.dropna()
#5.merge()

In [6]:
import pandas as pd
data={
    "A":[10,20,30],
    "B":[40,50,60],
    "C":[70,80,90],
    
}

In [19]:
pd.DataFrame(data)

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [20]:
#Q3.
df=pd.DataFrame({"values":[10,20,30,40,50]})

In [22]:
df

   values
0      10
1      20
2      30
3      40
4      50

In [34]:
df.sum(
)

values    150
dtype: int64

In [32]:
df[:3]

   values
0      10
1      20
2      30

In [35]:
df[:3].sum()

values    60
dtype: int64

In [56]:
#Q4.   
data={"Text":
     ["vyas","mayank"]}

In [57]:
df=pd.DataFrame(data)

In [58]:
df

     Text
0    vyas
1  mayank

In [59]:
column_name={"Text","Word_count"}

In [60]:
df1=pd.DataFrame(data,columns=column_name)

In [61]:
df1

  Word_count    Text
0        NaN    vyas
1        NaN  mayank

In [62]:
#Q5.
#1.DataFrame.size()
#2.DataFrame.shape()
import pandas as pd

In [63]:
df=pd.DataFrame({"a":[1,2,34]})

In [64]:
df.size

3

In [66]:
df.shape

(3, 1)

In [67]:
#Q6.
#answer= read_excel()

In [68]:
#Q7.
import pandas as pd

In [69]:
data={"Email":["mayank344@.com","vyas2737@.com"]}

In [71]:
df1=pd.DataFrame(data)

In [72]:
df1

            Email
0  mayank344@.com
1   vyas2737@.com

In [86]:
col_name={"Email","Username"}

In [87]:
df2=pd.DataFrame(df1,columns=col_name)

In [88]:
df2

            Email  Username
0  mayank344@.com       NaN
1   vyas2737@.com       NaN

In [95]:
#Q8.
import pandas as pd

In [107]:

data={
    "A":[6,7,8,9,12,4,3,24,5],
    "B":[0,3,4,5,6,78,64,224,42],
    "C":[2,3,4,5,6,24,5,6,7]
}

In [108]:
df=pd.DataFrame(data)

In [109]:
df

    A    B   C
0   6    0   2
1   7    3   3
2   8    4   4
3   9    5   5
4  12    6   6
5   4   78  24
6   3   64   5
7  24  224   6
8   5   42   7

In [122]:
df[df["A"]>5]

    A    B  C
0   6    0  2
1   7    3  3
2   8    4  4
3   9    5  5
4  12    6  6
7  24  224  6

In [123]:
df[df["B"]<10]

    A  B  C
0   6  0  2
1   7  3  3
2   8  4  4
3   9  5  5
4  12  6  6

In [124]:
#Q9.
import pandas as pd

In [125]:
df

    A    B   C
0   6    0   2
1   7    3   3
2   8    4   4
3   9    5   5
4  12    6   6
5   4   78  24
6   3   64   5
7  24  224   6
8   5   42   7

In [126]:
df.mean()

A     8.666667
B    47.333333
C     6.888889
dtype: float64

In [127]:
df.median()

A    7.0
B    6.0
C    5.0
dtype: float64

In [128]:
df.std()

A     6.363961
B    72.493103
C     6.603871
dtype: float64

In [136]:
df=pd.DataFrame({"Sale":[100,200,150,350,600,120,670],"Date":[20,21,22,23,24,25,26]})

In [137]:
df

   Sale  Date
0   100    20
1   200    21
2   150    22
3   350    23
4   600    24
5   120    25
6   670    26

In [146]:
col_name={"Sale","Date","MovingAverage"}

In [152]:
df3=pd.DataFrame(df,columns=col_name)

In [153]:
df3

   MovingAverage  Date  Sale
0            NaN    20   100
1            NaN    21   200
2            NaN    22   150
3            NaN    23   350
4            NaN    24   600
5            NaN    25   120
6            NaN    26   670

In [143]:
df3.mean()

MovingAverage           NaN
Date              23.000000
Sale             312.857143
dtype: float64

In [155]:
#Q.11 
import pandas as pd

In [176]:
Date=pd.date_range(start="2023-10-20",end="2023-10-26")

In [186]:
df=pd.DataFrame({"Date":Date,"Weekday":["Sunday","Monday","Tuesday","Wednesday","Thusday","Friday","Saturday"]})

In [187]:
df

        Date    Weekday
0 2023-10-20     Sunday
1 2023-10-21     Monday
2 2023-10-22    Tuesday
3 2023-10-23  Wednesday
4 2023-10-24    Thusday
5 2023-10-25     Friday
6 2023-10-26   Saturday

In [188]:
#Q12.
import pandas as pd

In [206]:
Date=pd.date_range(start="2023-01-01",end="2023-01-31")

In [207]:
Date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

In [209]:
mm=pd.DataFrame({"Date":Date})

In [210]:
mm

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

In [212]:
#Q.13
import pandas as pd